Repository: wldds94/wlsfcpt
Catalog: languages/wlsfcpt-*.po
Languages: de_de

source: Exotic
de_de: Exotisch

source: Noisette
de_de: Haselnuss

source: Earthy
de_de: Erdig

source: Citrusy
de_de: Zitronig

source: Fruity
de_de: Fruchtig

source: Not Available
de_de: Nicht verf√ºgbar

source: View All
de_de: Alle ansehen

source: Coming Soon
de_de: Bald Online

source: Flowers
de_de: Blumen

source: Discover our products
de_de: Produkte entdecken
